// Smile:
// 0001110000111000
// 0001110000111000
// 0001110000111000
// 0000000000000000
// 0000000000000000
// 0110000000000110
// 0011100000011100
// 0000111111110000

// R0 == top*32 + left/16


//будем хранить значение текущего регистра в n
@R0
D = M
@16384
D = D + A
@n
M = D

//изменяем 1 строку
//задаём значение 1 строки смайла
@7224
D = A
//смещаемся в 1 строку и задаём ему значение
@n
A = M
M = D

//смещаемся на следующий регистр, добавляя к n 32
@n
D = M
@32
D = D + A
@n
M = D

//изменяем 2 строку
//задаём значение 2 строки смайла
@7224
D = A
//смещаемся в 2 строку и задаём ему значение
@n
A = M
M = D

//смещаемся на следующий регистр, добавляя к n 32
@n
D = M
@32
D = D + A
@n
M = D

//изменяем 3 строку
//задаём значение 3 строки смайла
@7224
D = A
//смещаемся в 3 строку и задаём ему значение
@n
A = M
M = D

//смещаемся в 6 строку, добавляя к n 32
@n
D = M
@32
D = D + A
D = D + A
D = D + A
@n
M = D

//изменяем 6 строку
//задаём значение 6 строки смайла
@24582
D = A
//смещаемся в 6 строку и задаём ему значение
@n
A = M
M = D

//смещаемся на следующий регистр, добавляя к n 32
@n
D = M
@32
D = D + A
@n
M = D

//изменяем 7 строку
//задаём значение 7 строки смайла
@14364
D = A
//смещаемся в 7 строку и задаём ему значение
@n
A = M
M = D

//смещаемся на следующий регистр, добавляя к n 32
@n
D = M
@32
D = D + A
@n
M = D

//изменяем 8 строку
//задаём значение 8 строки смайла
@4080
D = A
//смещаемся в 8 строку и задаём ему значение
@n
A = M
M = D